УТ/src/Catalogs/ВидыКонтактнойИнформации/ВидыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКонтактнойИнформации</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>CRM_СправочникПартнерыЧастноеЛицо</name>
      <description>Контактная информация справочника &quot;Клиенты&quot; (для физических лиц)</description>
    </items>
    <items>
      <name>CRM_СправочникПартнерыКомпания</name>
      <description>Контактная информация справочника &quot;Клиенты&quot; (для юридических лиц)</description>
    </items>
    <items>
      <name>СправочникПартнеры</name>
      <description>Контактная информация справочника &quot;Партнеры&quot;</description>
    </items>
    <items>
      <name>СправочникПользователи</name>
      <description>Контактная информация справочника &quot;Пользователи&quot;</description>
    </items>
    <items>
      <name>СправочникCRM_ПотенциальныеКлиенты</name>
      <description>Контактная информация справочника &quot;Потенциальные клиенты&quot;</description>
    </items>
    <items>
      <name>СправочникКонтактныеЛицаПартнеров</name>
      <description>Контактная информация справочника &quot;Контактные лица партнеров&quot;</description>
    </items>
    <items>
      <name>СправочникКонтрагенты</name>
      <description>Контактная информация справочника &quot;Контрагенты&quot;</description>
    </items>
    <items>
      <name>СправочникОрганизации</name>
      <description>Контактная информация справочника &quot;Организации&quot;</description>
    </items>
    <items>
      <name>СправочникРегистрацииВНалоговомОргане</name>
      <description>Контактная информация справочника &quot;Регистрации в налоговом органе&quot;</description>
    </items>
    <items>
      <name>СправочникСклады</name>
      <description>Контактная информация справочника &quot;Склады&quot;</description>
    </items>
    <items>
      <name>СправочникТорговыеТочки</name>
      <description>Контактная информация справочника &quot;Торговые точки&quot;</description>
    </items>
    <items>
      <name>СправочникФизическиеЛица</name>
      <description>Контактная информация справочника &quot;Физические лица&quot;</description>
    </items>
  </predefined>
  <attributes>
    <name>ВводитьНомерПоМаске</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьСтрануВПредставление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПоляДругое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидРедактирования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьРедактированиеПользователем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДляФормул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяГруппы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПредопределенногоВида</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсправлятьУстаревшиеАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаскаНомераТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МеждународныйФорматАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МожноИзменятьСпособРедактирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьКорректность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПроверятьПоФИАС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьВводНесколькихЗначений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьНеактуальныеАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонСДобавочнымНомером</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоНациональныйАдрес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРедактированиеТолькоВДиалоге</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьОКТМО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьИсториюИзменений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ИспользоватьДляОповещений</name>
    <comment>Использовать для оповещений</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ИмяПредопределенногоЭлемента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьВсегда</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Представления</name>
    <attributes>
      <name>КодЯзыка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ/src/CommonModules/CRM_МетодыФормСправочниковСервер/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// CRM методы форм справочников сервер
//  
// В данный модуль вынесены методы подсистемы CRM, вызываемые из модулей типовых объектов. 
// Выносить можно только те методы, которые не вызывают стандартные методы типового модуля или обработчики форм. 
// Т.е. вызывают только те методы, что тоже вынесены из типового или не содержат таких вызовов.
// Для каждого объекта необходимо задать свою #Область с именем объекта и модуля, как он называется в метаданных.
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

#Область Справочник_Пользователи_ФормаЭлемента

Функция ПолучитьНавигационнуюСсылкуКартинки(ФайлКартинки, ИдентификаторФормы) Экспорт
	
	Попытка
		УстановитьПривилегированныйРежим(Истина);
		Возврат РаботаСФайлами.ДанныеФайла(ФайлКартинки, ИдентификаторФормы).СсылкаНаДвоичныеДанныеФайла;
	Исключение
		Возврат "";
	КонецПопытки;
	
КонецФункции

#КонецОбласти

#Область Справочник_Партнёры_ФормаЭлемента

// Функция вычисляет дубли в массиве элементов и очищает их.
//
//  Параметры:
//   Массив		- Массив - Массив для проверки.
//   ЭтоТелефон - Булево - Признак того, что проверяется телефон.
//
//  Возвращаемое значение
//   Массив - Массив - Проверенный массив.
//
Функция УдалитьПовторяющиесяЭлементыМассива(Массив, ЭтоТелефон) Экспорт
		
	ТекущийИндекс = 0; 
	ВсегоЭлементов = Массив.Количество(); 
	
	Пока ТекущийИндекс < ВсегоЭлементов Цикл 
		ТекИндекс2 = ТекущийИндекс + 1; 
		Пока ТекИндекс2 < ВсегоЭлементов Цикл 
			Если ЭтоТелефон Тогда
				Если сфпСофтФонПроСервер.сфпУбратьИзНомераТелефонаВсеПрефиксы(Массив[ТекИндекс2]) 
					= сфпСофтФонПроСервер.сфпУбратьИзНомераТелефонаВсеПрефиксы(Массив[ТекущийИндекс]) Тогда 
					Массив.Удалить(ТекИндекс2); 
					ВсегоЭлементов = ВсегоЭлементов - 1; 
				Иначе 
					ТекИндекс2 = ТекИндекс2 + 1; 
				КонецЕсли;
			Иначе
				Если Массив[ТекИндекс2] = (Массив[ТекущийИндекс]) Тогда 
					Массив.Удалить(ТекИндекс2); 
					ВсегоЭлементов = ВсегоЭлементов - 1; 
				Иначе 
					ТекИндекс2 = ТекИндекс2 + 1; 
				КонецЕсли;
			КонецЕсли;
		КонецЦикла; 
		ТекущийИндекс = ТекущийИндекс + 1; 
	КонецЦикла; 
	
	Возврат Массив; 
	
КонецФункции 

#КонецОбласти

#Область Справочник_ФизическиеЛица_ФормаЭлемента

Процедура ФизическиеЛицаФормаЭлементаПриСозданииНаСервере(Форма, Объект) Экспорт
	
	ДобавляемыеРеквизиты = Новый Массив;
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "НеобходимоОповещение") Тогда
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("НеобходимоОповещение", Новый ОписаниеТипов("Булево")));
	КонецЕсли;
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ОбъектОснование") Тогда
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ОбъектОснование", Новый ОписаниеТипов)); // Произвольный
	КонецЕсли;
	
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Если Форма.Элементы.Найти("CRM_ОтписалсяОтEmailРассылок") = Неопределено Тогда
		
		НовыйЭлемент = Форма.Элементы.Добавить(
			"CRM_ОтписалсяОтEmailРассылок", Тип("ПолеФормы"), Форма.Элементы["ГруппаКонтактнаяИнформация"]);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		
		Если CRM_ОбщегоНазначенияПовтИсп.ЭтоУТиВСК() Тогда
			НовыйЭлемент.ПутьКДанным = "Объект.CRM_ОтписалсяОтEmailРассылок";
		Иначе
			НовыйЭлемент.ПутьКДанным = "ФизическоеЛицо.CRM_ОтписалсяОтEmailРассылок";
		КонецЕсли;
		
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() И Форма.Параметры.Свойство("ПараметрыНового") Тогда
		Объект.Наименование = Форма.Параметры.ПараметрыНового.Наименование;
		
		МассивДопРеквизитов = Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.НайтиСтроки(Новый Структура("Тип,
			|Вид", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,
			 Справочники.ВидыКонтактнойИнформации.EMailФизическиеЛица));
		Если МассивДопРеквизитов.количество() > 0 Тогда
			Форма[МассивДопРеквизитов[0].ИмяРеквизита] = Форма.Параметры.ПараметрыНового.АдресПочты;
		КонецЕсли;
	КонецЕсли;
	
	// Учесть возможность создания из взаимодействия.
	Если Форма.Параметры.Свойство("Основание") Тогда
		Основание = Форма.Параметры.Основание;
		Если ЗначениеЗаполнено(Основание) И ТипЗнч(Основание) = Тип("Структура") Тогда
			Если Основание.Свойство("Объект") И ВзаимодействияКлиентСервер.ЯвляетсяВзаимодействием(Основание.Объект) Тогда
				Форма.НеобходимоОповещение = Истина;
				Форма.ОбъектОснование = Форма.Параметры.Основание.Объект;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Форма.Параметры.Свойство("Основание")
		 И ТипЗнч(Форма.Параметры.Основание) = Тип("ДокументСсылка.ТелефонныйЗвонок")
		 И Объект.Ссылка.Пустая() Тогда
		Форма.НеобходимоОповещение = Истина;
		Форма.ОбъектОснование = Форма.Параметры.Основание;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
